#include <stdio.h>
// 关于二进制，八进制，十六进制，十进制转换
// 二进制：逢二进一，各位上的权重是二的次幂，从低位开始依次是0,1,2,3增加
// 二进制转八进制，从右向左三个二进制位可以描述一个八进制位；
// 二进制转十六进制，从右向左四个二进制位可以描述一个十六进制位


//因为有些类型在存储时会发生截断，如 char 存储整形，所以表达式的计算需要先进行整形提升
//整形提升和，类型有关，如果是unsignde char 就是无符号位，如果是signed char，就是有符号位
//整形提升都是从高位补符号为或者0
//1.有符号类型的整形提升是在高位补符号位

//1.无符号类型的整形提升是高位补 0
int main()
{
    printf("%d\n",0153);//以0为开头的是八进制位；
    printf("%d\n",153);
    return 0;
}

int main()
{
    int a = 10;//一个整形四个字节，32个比特位，即是32个二进制位
    //00000000000000000000000000001010--原码
    //00000000000000000000000000001010--反码
    //00000000000000000000000000001010--补码
    int b = -10;
    //10000000000000000000000000001010--原码
    //11111111111111111111111111110101--反码
    //11111111111111111111111111110110--补码
    //取反加1
//     return 0;
// }


int main()
{
    //用补码进行计算
    return 0;
}

// 移位操作符，移动二进制位；移动的是补码
//   >>右移位；符号位不变，右边丢掉一位
//   <<左移位；左边丢弃一位,右边补零
int main()
{
    int a = 6;
    int b = (a << 1);
    printf("%d\n",b);
    a <<= 1;
    printf("%d\n",a);
    return 0;
}

// 左移一位有乘二的效果，移动n位有乘2n的效果
int main()
{
    int a = -3;
    int b = (a<<1);
    printf("%d\n",b);
    //10000000000000000000000000000011--原码
    //11111111111111111111111111111100--反码
    //11111111111111111111111111111101--补码

    //11111111111111111111111111111010
    //10000000000000000000000000000110--打印的是原码；

    return 0;
}

// 右移一位有乘二分之一的效果，右移n位有乘二分之一n的效果；
int main()
{
    int a = -10;
    int b =(a >> 1);
    //10000000000000000000000000001010--原码
    //11111111111111111111111111110110--补码
    //11111111111111111111111111111011--右移的补码
    //10000000000000000000000000000101--打印的原码
    printf("%d\n",b);
    return 0;
}

// 按位与，&，有0就0，都为1才是1；
int main()
{
    int a = 3;
    int b = -5;
    int c = a & b;
    //00000000000000000000000000000011--a的补码
    //10000000000000000000000000000101--b的原码
    //11111111111111111111111111111011--b的补码
    //00000000000000000000000000000011--c的补码
    printf("%d\n",c);//3
    return 0;
}


// 按位或，|，有1就1，都为0才是0；
int main()
{
    int a = 3;
	int b = -5;
	int c = a | b;
	//00000000000000000000000000000011 - 3的补码
	//10000000000000000000000000000101 - -5的原码
	//11111111111111111111111111111010
	//11111111111111111111111111111011 - -5的补码
	//
	// 00000000000000000000000000000011
	//|11111111111111111111111111111011
	// 11111111111111111111111111111011
	// 
	printf("%d\n", c);//-5

    return 0;

}

// 按位异或，^,相同为0，不同为1
// 任何数异或本身为0
int main()
{
    int a = 6;
    int b = -5;
    int c = a ^ b;
    //00000000000000000000000000000110--补码 6
    //10000000000000000000000000000101--原码
    //11111111111111111111111111111011--补码 -5
    //11111111111111111111111111111101--c的补码
    //10000000000000000000000000000011--c的原码
    printf("%d\n",c);
    return 0;
}

// ~按位取反，1变成0，0变成1；

// 交换两个数，不借助第三个变量；
int main()
{
    int a = 0;
    int b = 3;
    int c = 8;
    c = a;
    a = b;
    b = c;
    return 0;
}


int main()
{
    int a = 1;
    int b = 8;
    b = a + b;
    a = b - a;
    b = a - b;
    return 0;
}

int main()
{
    int a = 0;
    int b = 0;
    scanf("%d %d",&a,&b);
    a = a ^ b;
    b = a ^ b;
    a = a ^ b;
    //任何数和0异或的结果还是这个数
    printf("%d %d\n",a,b);
    return 0;
}

// 计算一个二进制序列有多少个1；
int main()
{
    int cnt = 0;
    int n = 0;
    scanf("%d",&n);
    int i = 0;
    for(i = 0;i<32;i++)
    {
        if( (n %2) == 1 )
        cnt ++;
    }
    return 0;
}

int count_one(int x)
{
    int cnt = 0;
    for(int i = 0;i<32;i++)
    {
        if(((x >> 1) & 1) == 1)
         cnt ++;
    }
    return cnt;
}

//算法；去掉1；n = n&(n-1)
//n    00110
//n-1  00101
//n    00100
//n-1  00011
//n    00000
//  n&(n-1)最后的结果是0，几次到0，就有几个1；
int count_one(int x)
{
    int cnt = 0;
    while(x)
    {
        x = x&(x-1);
        cnt++;
    }
    return cnt ;
}

int main()
{
    int n = 0;
    scanf("%d",&n);
    int r = count_one(n);
    printf("%d\n",r);
    return 0;
}

// 置换二进制序列从右往左的第五个数
int main()
{
    int a = 13;
    //   00001101;
    // | 00010000;
    //00011101
    // 1<<4   00010000
    a |= (1 << 4);
    printf("%d\n",a);
    //11101111;
    a &= ~(1 << 4);
    printf("%d\n",a);
    return 0;
}

// 逗号表达式
// 从右往左，依次计算，但结果是最后一个

	int arr[10] = {0};

	arr[5] = 8;//[] - 下标引用操作符
	//arr , 5是[]的两个操作数

	3 + 5;
	return 0;
}

int Add(int x, int y)
{
	return x + y;
}

void test()
{

}

int main()
{
	printf("hehe"); //()是函数调用操作符
	int r = Add(3, 5);//()是函数调用操作符
	//()也是有操作数：函数名和参数都是()的操作数
	test();
	return 0;
}

// 结构体

struct stu
{
    //一个或多个成员 - 这些都是用来描述学生的
    char name [10];
    char id [12];
    int age;
}s1,s2,s3;//全局变量

struct stu s1;
struct stu s2;

int main()
{
    int num = 0;
    struct stu s1 = {"zhangsan","2025440304",18};
    struct stu s2 = {.age=18,.name="wangcai",.id="2025440304"};
    struct stu s3;//局本变量
    return 0;
}
// 结构体是一种特殊的类型，和int,double,float,char没有本质的区别；

 struct peo
{
    int age ;
    char name [12];
    char tele [12];
};

struct ebook
{
    struct peo data[100];//可以存放100个人
    int count;//记录已经存放的个数
};

int main()
{
    struct peo p1 = {18,"wnager","2025440304"};
    struct ebook eb = {{{18,"yiyi","1538466919"},{17,"dada","556552"}},0};
    printf("%s\n",p1.name);
    printf("%s\n",eb.data[1].name);
    return 0;
}