#include<stdio.h>


//int main()
//{
//	printf("hehe\n");
//	
//	main();
//
//	return 0;
//}
//


//计算n的阶乘（不考虑溢出），n的阶乘就是1~n的数字累积相乘。
//
//int Fact(int n)
//{
//	if (n == 0)
//		return 1;
//	else if (n > 0)
//		return n * Fact(n - 1);
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int r = Fact(n);
//	printf("%d\n", r);
//
//	return 0;
//}


//输入一个整数m，按照顺序打印整数的每一位。
//1234
// 1234%10=4
// 1234/10=123
// 123%10=3
// 123/10=12
// 12%10=2
// 12/10=1
// 1%10=1
// 1/10=0
// 
//1 2 3 4
//

//
//
//Print(1234)
//Print(123) + 4
//Print(12) 3 4 
//Print(1) 2 3 4
//

//void Print(int n)
//{
//	if (n > 9)
//		Print(n / 10);
//
//	printf("%d ", n % 10);
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	Print(n);//123
//
//	return 0;
//}
//
//
//int Fact(int n)
//{
//	int i = 0;
//	int ret = 1;
//	for (i = 1; i <= n; i++)
//	{
//		ret *= i;//ret = ret*i;
//	}
//	return ret;
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int r = Fact(n);//123
//	printf("%d\n", r);
//
//	return 0;
//}
//

//int count = 0;
//
//int Fib(int n)
//{
//	if (n == 3)
//		count++;
//	if (n <= 2)
//		return 1;
//	else
//		return Fib(n - 1) + Fib(n - 2);
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int r = Fib(n);
//	printf("%d\n", r);
//	printf("count = %d\n", count);
//	return 0;
//}
////


//
//int Fib(int n)
//{
//	int a = 1;
//	int b = 1;
//	int c = 1;
//
//	while (n>2)
//	{
//		c = a + b;
//		a = b;
//		b = c;
//		n--;
//	}
//
//	return c;
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int r = Fib(n);
//	printf("%d\n", r);
//	return 0;
//}
//

//void test(int n)
//{
//	printf("%d ", n);
//	if (n <= 10000)
//	{
//		test(n+1);
//	}
//}
//
//int main()
//{
//	test(1);
//	return 0;
//}
//
//
//
//int main()
//{
//	//printf("%d\n", 153);
//	//printf("%d\n", 0153);
//
//	int b = 10;
//	//00000000000000000000000000001010-- 原码
//	//00000000000000000000000000001010-- 反码
//	//00000000000000000000000000001010-- 补码
//
//	int a = -10;
//	//10000000000000000000000000001010 -- 原码
//	//11111111111111111111111111110101 -- 反码
//	//11111111111111111111111111110110 -- 补码
//
//	//11111111111111111111111111110110 -- 补码
//	//10000000000000000000000000001001
//	//10000000000000000000000000001010 -- 原码
//
//	return 0;
//}
//
//整数在内存中存储的是2进制的补码
//

//
//int main()
//{
//	//1 - 1;
//	//1 + (-1)
//	//尝试用原码计算
//	//000000000000000000000000000000001  1的原码
//	//100000000000000000000000000000001  -1的原码
//	// 
//	//100000000000000000000000000000010  -2 //err
//
//	//尝试使用补码计算
//	//000000000000000000000000000000001  1的补码
//	//100000000000000000000000000000001  -1的原码
//	//111111111111111111111111111111110
//	//111111111111111111111111111111111  -1的补码
//	//000000000000000000000000000000001
//	//000000000000000000000000000000000 -- 0
//	//
//	return 0;
//}